scripts/.org/README.org
* Scripts

This is the scripts directory, where we place scripts of various types to help with various activities. :)

Let's get a little more concrete though.

** apps-process-count.sh
A simple script to query the Erlang VMs process count
#+BEGIN_EXAMPLE bash
./scripts/apps-process-count.sh
10
#+END_EXAMPLE
** bump-copyright-year.sh
Python script to walk the supplied files and bumps the copyright year if appropriate.
#+BEGIN_EXAMPLE
./scripts/bump-copyright-year.sh [FILE]
#+END_EXAMPLE
** check-app-registered.sh
Checks Erlang applications for registered processes and compares that to the application's .app.src file.
#+BEGIN_EXAMPLE
./scripts/check-app-registered.sh [PATH/TO/APP]
#+END_EXAMPLE

For example, I set `{registered, []} in callflow.app.src, then ran the script:
#+BEGIN_EXAMPLE
./scripts/check-app-registered.sh applications/callflow
cf_event_handler_sup, callflow_sup, cf_exe_sup
applications/callflow has no registered modules??
1 errors
1 errors in total
#+END_EXAMPLE
Now you have a listing of registered processes to put in your .app.src
** check-dialyzer.escript
An Erlang escript that dialyzes changed files. Run it using the makefile target 'dialyze' with the files to dialyze:
#+BEGIN_EXAMPLE
TO_DIALYZE=applications/callflow/ebin/callflow_sup.beam make dialyze
scanning "applications/callflow/ebin/callflow_sup.beam"
0 Dialyzer warnings
#+END_EXAMPLE

Typically `TO_DIALYZE` would be a generated list of files.

Do note: this will only check the file itself for issues. To really leverage Dialyzer, you'll want to include remote project modules for Dialyzer to use as well.
** check-release-startup.sh
Creates a release, starts it, and issues some commands to test that the release starts up and appears to be running
** check-xref.escript
An Erlang escript for cross referencing (xref) calls to remote modules. Set `TO_XREF` to ebin paths (or use the default):
#+BEGIN_EXAMPLE
make xref
Pass: global
Loading modules...
Running xref analysis...
Xref: listing undefined_function_calls
Xref: listing undefined_functions
Done
#+END_EXAMPLE
If there are any calls to non-existant modules, or non-exported functions, you will get errors listed here.
** code_checks.bash
Checks source code files for various formatting expectations and exits if any are found.
#+BEGIN_EXAMPLE
./scripts/code_checks.bash applications/crossbar/src/cb_context.erl
Check for andalso/orelse dropped lines
Check for uses of module in lieu of ?MODULE
Check for TAB characters
Check for trailing whitespaces
#+END_EXAMPLE
** conn-to-apps.sh
Opens a remote shell to the kazoo_apps@hostname VM.
#+BEGIN_EXAMPLE
./scripts/conn-to-apps.sh [{VM@HOSTNAME}, {LOCAL_SHELL@HOSTNAME}]
#+END_EXAMPLE
** conn-to-ecallmgr.sh
A convenience wrapper for connecting to ecallmgr@HOSTNAME via conn-to-apps.sh
** crash-apps.sh
Forces the running VM to halt, producing a crashdump, and exiting with status code 1 (as per the [[http://erldocs.com/18.0/erts/erlang.html?i=2&search=halt#halt/2][docs]]). Currently hard-coded the VM name to 'kazoo_apps'
** crash-ecallmgr.sh
Same as crash-apps.sh but for the ecallmgr VM.
** dev-exec-mfa.sh
Runs M:F(A) on the node:
#+INCLUDE "../dev-exec-mfa.sh" :lines "3-6"
** dev-start-apps.sh
Starts a VM with an interactive shell. {VM_NAME} defaults to 'kazoo_apps'
#+BEGIN_EXAMPLE shell
./scripts/dev-start-apps.sh {VM_NAME}
#+END_EXAMPLE
** dev-start-ecallmgr.sh
Defaults node name to 'ecallmgr'; otherwise the same as dev-start-apps.sh
** dev/kazoo.sh
When using releases, executes a release command against the running VM:
#+BEGIN_EXAMPLE shell
KAZOO_CONFIG=/etc/kazoo/core/config.ini ./scripts/dev/kazoo.sh {CMD}
#+END_EXAMPLE

{CMD} can be:
- 'attach': Attach to a running VM
- 'console': connect to the VM with an interactive shell
- 'escript': Run an escript under the node's environment
- 'eval': evaluates the string in the running VM
- 'foreground': start up the release in the foreground
- 'pid': get the OS pid of the VM
- 'ping': test aliveness of the VM
- 'reboot': restart the VM completely (new OS process)
- 'remote_console': connect as a remote shell
- 'restart': restart the VM without exiting the OS process
- 'rpc': execute a remote procedure call
- 'rpcterms':
- 'start'/'start_boot': start the VM
- 'stop': stop the VM
- 'unpack': Unpack a tar.gz for upgrade/downgrade/installation
- 'upgrade'/'downgrade'/'install': perform an upgrade/downgrade/installation
** dev/sup.sh
Runs the SUP escript against the running release
** dialyze-usage.bash
Given a module name, such as 'props' or 'kz_json', search core/applications for modules that make calls to the supplied module and dialyze those beam files looking for dialyzer complaints. You will likely see complaints unrelated to your supplied module - go ahead and fix those too if possilbe ;)

The more heavily utilized the module is, the longer this will take to run!

#+BEGIN_EXAMPLE shell
 ./scripts/dialyze-usage.bash kz_config
dialyzing usages of kz_config
  Checking whether the PLT .kazoo.plt is up-to-date... yes
  Proceeding with analysis...
kz_dataconfig.erl:26: Function connection/0 has no local return
kz_dataconfig.erl:27: The call kz_config:get('data','config',['bigcouch',...]) breaks the contract (section(),atom(),Default) -> kz_proplist() | Default
kz_dataconfig.erl:32: Function connection_options/1 will never be called
...
 done in 0m4.08s
done (warnings were emitted)
#+END_EXAMPLE
** ecallmgr-process-count.sh
Connects to the ecallmgr VM and outputs a count of running Erlang processes.
** format-json.sh
Python script to format JSON files (like CouchDB views, JSON schemas) and write the formatted version back to the file. 'make apis' runs this as part of its instructions.
#+BEGIN_EXAMPLE shell
./scripts/format-json.sh path/to/file.json [path/to/other/file.json,...]
#+END_EXAMPLE
** generate-api-endpoints.escript
Builds the Crossbar reference docs in 'applications/crossbar/doc/ref'. Helps detect when Crossbar endpoints have changes to their functionality that is client-facing.

Also builds the [[http://swagger.io/][Swagger]] JSON file in applications/crossbar/priv/api/swagger.json
** generate-fs-headers-hrl.escript
Parses the ecallmgr code looking for keys used to access values in the FreeSWITCH proplist and builds a header file at applications/ecallmgr/src/fs_event_filters.hrl for use when initializing mod_kazoo.
** generate-schemas.escript
Parses the core/applications code looking for calls to kapps_config (module used to access documents in the system_config database) and building a base JSON schema file for each document found.

Also parses callflow's action modules looking for keys used to access values in the Data JSON object to build a base JSON schema file for each callflow action.
