scripts/README.md
- [Scripts](#orgheadline36)
  - [apps-process-count.sh](#orgheadline1)
  - [bump-copyright-year.sh](#orgheadline2)
  - [check-app-registered.sh](#orgheadline3)
  - [check-dialyzer.escript](#orgheadline4)
  - [check-release-startup.sh](#orgheadline5)
  - [check-xref.escript](#orgheadline6)
  - [code\_checks.bash](#orgheadline7)
  - [conn-to-apps.sh](#orgheadline8)
  - [conn-to-ecallmgr.sh](#orgheadline9)
  - [crash-apps.sh](#orgheadline10)
  - [crash-ecallmgr.sh](#orgheadline11)
  - [dev-exec-mfa.sh](#orgheadline12)
  - [dev-start-apps.sh](#orgheadline13)
  - [dev-start-ecallmgr.sh](#orgheadline14)
  - [dev/kazoo.sh](#orgheadline15)
  - [dev/sup.sh](#orgheadline16)
  - [dialyze-usage.bash](#orgheadline17)
  - [ecallmgr-process-count.sh](#orgheadline18)
  - [format-json.sh](#orgheadline19)
  - [generate-api-endpoints.escript](#orgheadline20)
  - [generate-fs-headers-hrl.escript](#orgheadline21)
  - [generate-schemas.escript](#orgheadline22)
  - [no\_raw\_json.escript](#orgheadline23)
  - [rabbitmq-generic.sh](#orgheadline24)
  - [rabbitmq-server.init](#orgheadline25)
  - [setup-dev.sh](#orgheadline26)
  - [setup-git.sh](#orgheadline27)
  - [src2any.escript](#orgheadline28)
  - [start-apps.sh](#orgheadline29)
  - [start-ecallmgr.sh](#orgheadline30)
  - [state-of-docs.sh](#orgheadline31)
  - [update-the-types.sh](#orgheadline32)
  - [validate-js.sh](#orgheadline33)
  - [validate-swagger.sh](#orgheadline34)
  - [wh\_to\_kz.sh](#orgheadline35)

# Scripts<a id="orgheadline36"></a>

This is the scripts directory, where we place scripts of various types to help with various activities. :)

Let's get a little more concrete though.

## apps-process-count.sh<a id="orgheadline1"></a>

A simple script to query the Erlang VMs process count

    ./scripts/apps-process-count.sh
    10

## bump-copyright-year.sh<a id="orgheadline2"></a>

Python script to walk the supplied files and bumps the copyright year if appropriate.

    ./scripts/bump-copyright-year.sh [FILE]

## check-app-registered.sh<a id="orgheadline3"></a>

Checks Erlang applications for registered processes and compares that to the application's .app.src file.

    ./scripts/check-app-registered.sh [PATH/TO/APP]

For example, I set \`{registered, []} in callflow.app.src, then ran the script:

    ./scripts/check-app-registered.sh applications/callflow
    cf_event_handler_sup, callflow_sup, cf_exe_sup
    applications/callflow has no registered modules??
    1 errors
    1 errors in total

Now you have a listing of registered processes to put in your .app.src

## check-dialyzer.escript<a id="orgheadline4"></a>

An Erlang escript that dialyzes changed files. Run it using the makefile target 'dialyze' with the files to dialyze:

    TO_DIALYZE=applications/callflow/ebin/callflow_sup.beam make dialyze
    scanning "applications/callflow/ebin/callflow_sup.beam"
    0 Dialyzer warnings

Typically \`TO\_DIALYZE\` would be a generated list of files.

Do note: this will only check the file itself for issues. To really leverage Dialyzer, you'll want to include remote project modules for Dialyzer to use as well.

## check-release-startup.sh<a id="orgheadline5"></a>

Creates a release, starts it, and issues some commands to test that the release starts up and appears to be running

## check-xref.escript<a id="orgheadline6"></a>

An Erlang escript for cross referencing (xref) calls to remote modules. Set \`TO\_XREF\` to ebin paths (or use the default):

    make xref
    Pass: global
    Loading modules...
    Running xref analysis...
    Xref: listing undefined_function_calls
    Xref: listing undefined_functions
    Done

If there are any calls to non-existant modules, or non-exported functions, you will get errors listed here.

## code\_checks.bash<a id="orgheadline7"></a>

Checks source code files for various formatting expectations and exits if any are found.

    ./scripts/code_checks.bash applications/crossbar/src/cb_context.erl
    Check for andalso/orelse dropped lines
    Check for uses of module in lieu of ?MODULE
    Check for TAB characters
    Check for trailing whitespaces

## conn-to-apps.sh<a id="orgheadline8"></a>

Opens a remote shell to the kazoo\_apps@hostname VM.

    ./scripts/conn-to-apps.sh [{VM@HOSTNAME}, {LOCAL_SHELL@HOSTNAME}]

## conn-to-ecallmgr.sh<a id="orgheadline9"></a>

A convenience wrapper for connecting to ecallmgr@HOSTNAME via conn-to-apps.sh

## crash-apps.sh<a id="orgheadline10"></a>

Forces the running VM to halt, producing a crashdump, and exiting with status code 1 (as per the [docs](http://erldocs.com/18.0/erts/erlang.html?i=2&search=halt#halt/2)). Currently hard-coded the VM name to 'kazoo\_apps'

## crash-ecallmgr.sh<a id="orgheadline11"></a>

Same as crash-apps.sh but for the ecallmgr VM.

## dev-exec-mfa.sh<a id="orgheadline12"></a>

Runs M:F(A) on the node: \\#+INCLUDE "../dev-exec-mfa.sh" :lines "3-6"

## dev-start-apps.sh<a id="orgheadline13"></a>

Starts a VM with an interactive shell. {VM\_NAME} defaults to 'kazoo\_apps'

    ./scripts/dev-start-apps.sh {VM_NAME}

## dev-start-ecallmgr.sh<a id="orgheadline14"></a>

Defaults node name to 'ecallmgr'; otherwise the same as dev-start-apps.sh

## dev/kazoo.sh<a id="orgheadline15"></a>

When using releases, executes a release command against the running VM:

    KAZOO_CONFIG=/etc/kazoo/core/config.ini ./scripts/dev/kazoo.sh {CMD}

{CMD} can be:

-   'attach': Attach to a running VM
-   'console': connect to the VM with an interactive shell
-   'escript': Run an escript under the node's environment
-   'eval': evaluates the string in the running VM
-   'foreground': start up the release in the foreground
-   'pid': get the OS pid of the VM
-   'ping': test aliveness of the VM
-   'reboot': restart the VM completely (new OS process)
-   'remote\_console': connect as a remote shell
-   'restart': restart the VM without exiting the OS process
-   'rpc': execute a remote procedure call
-   'rpcterms':
-   'start'/'start\_boot': start the VM
-   'stop': stop the VM
-   'unpack': Unpack a tar.gz for upgrade/downgrade/installation
-   'upgrade'/'downgrade'/'install': perform an upgrade/downgrade/installation

## dev/sup.sh<a id="orgheadline16"></a>

Runs the SUP escript against the running release

## dialyze-usage.bash<a id="orgheadline17"></a>

Given a module name, such as 'props' or 'kz\_json', search core/applications for modules that make calls to the supplied module and dialyze those beam files looking for dialyzer complaints. You will likely see complaints unrelated to your supplied module - go ahead and fix those too if possilbe ;)

The more heavily utilized the module is, the longer this will take to run!

     ./scripts/dialyze-usage.bash kz_config
    dialyzing usages of kz_config
      Checking whether the PLT .kazoo.plt is up-to-date... yes
      Proceeding with analysis...
    kz_dataconfig.erl:26: Function connection/0 has no local return
    kz_dataconfig.erl:27: The call kz_config:get('data','config',['bigcouch',...]) breaks the contract (section(),atom(),Default) -> kz_proplist() | Default
    kz_dataconfig.erl:32: Function connection_options/1 will never be called
    ...
     done in 0m4.08s
    done (warnings were emitted)

## ecallmgr-process-count.sh<a id="orgheadline18"></a>

Connects to the ecallmgr VM and outputs a count of running Erlang processes.

## format-json.sh<a id="orgheadline19"></a>

Python script to format JSON files (like CouchDB views, JSON schemas) and write the formatted version back to the file. 'make apis' runs this as part of its instructions.

    ./scripts/format-json.sh path/to/file.json [path/to/other/file.json,...]

## generate-api-endpoints.escript<a id="orgheadline20"></a>

Builds the Crossbar reference docs in 'applications/crossbar/doc/ref'. Helps detect when Crossbar endpoints have changes to their functionality that is client-facing.

Also builds the [Swagger](http://swagger.io/) JSON file in applications/crossbar/priv/api/swagger.json

## generate-fs-headers-hrl.escript<a id="orgheadline21"></a>

Parses the ecallmgr code looking for keys used to access values in the FreeSWITCH proplist and builds a header file at applications/ecallmgr/src/fs\_event\_filters.hrl for use when initializing mod\_kazoo.

## generate-schemas.escript<a id="orgheadline22"></a>

Parses the core/applications code looking for calls to kapps\_config (module used to access documents in the system\_config database) and building a base JSON schema file for each document found.

Also parses callflow's action modules looking for keys used to access values in the Data JSON object to build a base JSON schema file for each callflow action.
