scripts/.org/README.org
** no_raw_json.escript
Erlang has a handful of internal representations of JSON used by the various parses. The kz_json module handles these details and Kazoo programmers should treat the data structure used as opaque. This script parses the codebase looking for instances where the opaqueness of the data structure is violated.
** rabbitmq-generic.sh
Wrapper for running rabbitmq script commands?
** rabbitmq-server.init
Init.d script for rabbitmq
** setup-dev.sh
Script to setup a dev environment including:
- Symlink SUP to /usr/bin
- Symlink rabbitmq init.d script to /etc/init.d
- Symlink kazoo init.d scripts to /etc/init.d
- Reset RabbitMQ mnesia databases, logs
- Setup users for rabbitmq and kazoo
** setup-git.sh
Setup the username/email to use in Git commits and other Git settings
** src2any.escript
Reads the .app.src file and writes a .src file?
** start-apps.sh
Starts a VM in the background with name kazoo_apps
** start-ecallmgr.sh
Starts a VM in the background with name ecallmgr
