scripts/README.md

## no\_raw\_json.escript<a id="orgheadline23"></a>

Erlang has a handful of internal representations of JSON used by the various parses. The kz\_json module handles these details and Kazoo programmers should treat the data structure used as opaque. This script parses the codebase looking for instances where the opaqueness of the data structure is violated.

## rabbitmq-generic.sh<a id="orgheadline24"></a>

Wrapper for running rabbitmq script commands?

## rabbitmq-server.init<a id="orgheadline25"></a>

Init.d script for rabbitmq

## setup-dev.sh<a id="orgheadline26"></a>

Script to setup a dev environment including:

-   Symlink SUP to /usr/bin
-   Symlink rabbitmq init.d script to /etc/init.d
-   Symlink kazoo init.d scripts to /etc/init.d
-   Reset RabbitMQ mnesia databases, logs
-   Setup users for rabbitmq and kazoo

## setup-git.sh<a id="orgheadline27"></a>

Setup the username/email to use in Git commits and other Git settings

## src2any.escript<a id="orgheadline28"></a>

Reads the .app.src file and writes a .src file?

## start-apps.sh<a id="orgheadline29"></a>

Starts a VM in the background with name kazoo\_apps

## start-ecallmgr.sh<a id="orgheadline30"></a>

Starts a VM in the background with name ecallmgr
