scripts/README.md

## state-of-docs.sh<a id="orgheadline31"></a>

Searches for undocumented APIs and reports percentage of doc coverage.

    ./scripts/state-of-docs.sh
    Undocumented API endpoints:
    > PATCH /v2/accounts/{ACCOUNT_ID}/configs/{CONFIG_ID}
    > PUT /v2/accounts/{ACCOUNT_ID}/onboard
    > DELETE /v2/accounts/{ACCOUNT_ID}/faxboxes/{FAXBOX_ID}
    > GET /v2/system_configs/{SYSTEM_CONFIG_ID}/{NODE}
    > GET /v2/accounts/{ACCOUNT_ID}/acls
    > GET /v2/accounts/{ACCOUNT_ID}/blacklists
    > PUT /v2/accounts/{ACCOUNT_ID}/temporal_rules_sets
    > GET /v2/accounts/{ACCOUNT_ID}/blacklists/{BLACKLIST_ID}
    > GET /v2/accounts/{ACCOUNT_ID}/braintree/credits
    > PUT /v2/accounts/{ACCOUNT_ID}/global_provisioner_templates
    > POST /v2/accounts/{ACCOUNT_ID}/whitelabel/logo
    > DELETE /v2/accounts/{ACCOUNT_ID}/configs/{CONFIG_ID}
    > POST /v2/accounts/{ACCOUNT_ID}/whitelabel/welcome
    > PATCH /v2/accounts/{ACCOUNT_ID}/temporal_rules_sets/{TEMPORAL_RULE_SET}
    > GET /v2/accounts/{ACCOUNT_ID}/local_provisioner_templates/{TEMPLATE_ID}
    > PUT /v2/google_auth
    > PUT /v2/accounts/{ACCOUNT_ID}/cccps/{CCCP_ID}
    > PUT /v2/accounts/{ACCOUNT_ID}/resource_selectors/name/{SELECTOR_NAME}/resource/{RESOURCE_ID}
    > DELETE /v2/accounts/{ACCOUNT_ID}/resource_templates/{RESOURCE_TEMPLATE_ID}
    > GET /v2/accounts/{ACCOUNT_ID}/whitelabel/{WHITELABEL_DOMAIN}/icon
    > POST /v2/accounts/{ACCOUNT_ID}/cccps/{CCCP_ID}
    > GET /v2/accounts/{ACCOUNT_ID}/alerts
    > POST /v2/accounts/{ACCOUNT_ID}/access_lists
    > GET /v2/accounts/{ACCOUNT_ID}/storage
    > POST /v2/accounts/{ACCOUNT_ID}/presence
    > POST /v2/accounts/{ACCOUNT_ID}/temporal_rules_sets/{TEMPORAL_RULE_SET}
    > GET /v2/accounts/{ACCOUNT_ID}/sms/{SMS_ID}
    > DELETE /v2/accounts/{ACCOUNT_ID}/access_lists
    > GET /v2/accounts/{ACCOUNT_ID}/access_lists
    > GET /v2/accounts/{ACCOUNT_ID}/resource_selectors
    > POST /v2/accounts/{ACCOUNT_ID}/agents/{USER_ID}/queue_status
    > POST /v2/accounts/{ACCOUNT_ID}/resource_selectors/name/{SELECTOR_NAME}/resource/{RESOURCE_ID}
    > PUT /v2/accounts/{ACCOUNT_ID}/resource_templates
    > GET /v2/accounts/{ACCOUNT_ID}/braintree/cards
    > DELETE /v2/accounts/{ACCOUNT_ID}/bulk
    > GET /v2/shared_auth
    > GET /v2/accounts/{ACCOUNT_ID}/braintree/addresses
    > GET /v2/accounts/{ACCOUNT_ID}/queues/stats
    > GET /v2/accounts/{ACCOUNT_ID}/cccps/{CCCP_ID}
    > DELETE /v2/accounts/{ACCOUNT_ID}/alerts/{ALERT_ID}
    > DELETE /v2/accounts/{ACCOUNT_ID}/cccps/{CCCP_ID}
    > GET /v2/system_configs
    > GET /v2/accounts/{ACCOUNT_ID}/whitelabel
    > GET /v2/accounts/{ACCOUNT_ID}/queues/{QUEUE_ID}
    > DELETE /v2/accounts/{ACCOUNT_ID}/whitelabel
    > GET /v2/accounts/{ACCOUNT_ID}/rate_limits
    > GET /v2/accounts/{ACCOUNT_ID}/templates
    > PUT /v2/accounts/{ACCOUNT_ID}/blacklists
    > POST /v2/accounts/{ACCOUNT_ID}/braintree/customer
    > GET /v2/accounts/{ACCOUNT_ID}/local_provisioner_templates/{TEMPLATE_ID}/image
    > PUT /v2/accounts/{ACCOUNT_ID}/temporal_rules
    > GET /v2/accounts/{ACCOUNT_ID}/freeswitch
    > GET /v2/accounts/{ACCOUNT_ID}/faxboxes/{FAXBOX_ID}
    > DELETE /v2/accounts/{ACCOUNT_ID}/global_provisioner_templates/{TEMPLATE_ID}
    > POST /v2/accounts/{ACCOUNT_ID}/resource_selectors
    > POST /v2/accounts/{ACCOUNT_ID}/queues/{QUEUE_ID}
    > PUT /v2/accounts/{ACCOUNT_ID}/configs/{CONFIG_ID}
    > PUT /v2/accounts/{ACCOUNT_ID}/queues/eavesdrop
    > GET /v2/accounts/{ACCOUNT_ID}/menus/{MENU_ID}
    > POST /v2/accounts/{ACCOUNT_ID}/menus/{MENU_ID}
    > GET /v2/accounts/{ACCOUNT_ID}/braintree/customer
    > GET /v2/accounts/{ACCOUNT_ID}/whitelabel/welcome
    > PUT /v2/accounts/{ACCOUNT_ID}/braintree/credits
    > PUT /v2/accounts/{ACCOUNT_ID}/templates/{TEMPLATE_NAME}
    > PATCH /v2/accounts/{ACCOUNT_ID}/queues/{QUEUE_ID}
    > DELETE /v2/accounts/{ACCOUNT_ID}/storage
    > DELETE /v2/accounts/{ACCOUNT_ID}/queues/{QUEUE_ID}/roster
    > GET /v2/accounts/{ACCOUNT_ID}/temporal_rules_sets
    > GET /v2/accounts/{ACCOUNT_ID}/queues
    > PUT /v2/accounts/{ACCOUNT_ID}/storage
    > DELETE /v2/accounts/{ACCOUNT_ID}/braintree/addresses/{ADDRESS_ID}
    > PUT /v2/accounts/{ACCOUNT_ID}/cccps
    > GET /v2/accounts/{ACCOUNT_ID}/configs/{CONFIG_ID}
    > GET /v2/accounts/{ACCOUNT_ID}/conferences/{CONFERENCE_ID}/participants/{PARTICIPANT_ID}
    > PUT /v2/accounts/{ACCOUNT_ID}/storage/plans
    > GET /v2/accounts/{ACCOUNT_ID}/local_provisioner_templates
    > POST /v2/accounts/{ACCOUNT_ID}/queues/{QUEUE_ID}/roster
    > DELETE /v2/accounts/{ACCOUNT_ID}/sms/{SMS_ID}
    > POST /v2/accounts/{ACCOUNT_ID}/local_provisioner_templates/{TEMPLATE_ID}
    > DELETE /v2/system_configs/{SYSTEM_CONFIG_ID}/{NODE}
    > GET /v2/accounts/{ACCOUNT_ID}/services/plan
    > POST /v2/accounts/{ACCOUNT_ID}/resource_templates/{RESOURCE_TEMPLATE_ID}
    > PUT /v2/accounts/{ACCOUNT_ID}/braintree/addresses
    > POST /v2/accounts/{ACCOUNT_ID}/blacklists/{BLACKLIST_ID}
    > GET /v2/accounts/{ACCOUNT_ID}/agents/{USER_ID}/status
    > GET /v2/accounts/{ACCOUNT_ID}/resource_templates
    > PATCH /v2/accounts/{ACCOUNT_ID}/connectivity/{CONNECTIVITY_ID}
    > GET /v2/accounts/{ACCOUNT_ID}/storage/plans/{STORAGE_PLAN_ID}
    > POST /v2/accounts/{ACCOUNT_ID}/whitelabel/icon
    > GET /v2/accounts/{ACCOUNT_ID}/agents/{USER_ID}/queue_status
    > PUT /v2/accounts/{ACCOUNT_ID}/whitelabel
    > DELETE /v2/accounts/{ACCOUNT_ID}/storage/plans/{STORAGE_PLAN_ID}
    > POST /v2/accounts/{ACCOUNT_ID}/temporal_rules/{TEMPORAL_RULE_ID}
    > GET /v2/accounts/{ACCOUNT_ID}/storage/plans
    > GET /v2/accounts/{ACCOUNT_ID}/braintree/transactions/{TRANSACTION_ID}
    > POST /v2/accounts/{ACCOUNT_ID}/global_provisioner_templates/{TEMPLATE_ID}/image
    > POST /v2/system_configs/{SYSTEM_CONFIG_ID}
    > DELETE /v2/accounts/{ACCOUNT_ID}/resource_selectors/name/{SELECTOR_NAME}/resource/{RESOURCE_ID}
    > GET /v2/accounts/{ACCOUNT_ID}/agents/{USER_ID}
    > PUT /v2/accounts/{ACCOUNT_ID}/queues/{QUEUE_ID}/eavesdrop
    > POST /v2/accounts/{ACCOUNT_ID}/signup/{THING}
    > GET /v2/accounts/{ACCOUNT_ID}/resource_selectors/name/{SELECTOR_NAME}/resource/{RESOURCE_ID}
    > GET /v2/sup/{MODULE}/{FUNCTION}
    > PUT /v2/accounts/{ACCOUNT_ID}/queues
    > GET /v2/accounts/{ACCOUNT_ID}/metaflows
    > PUT /v2/accounts/{ACCOUNT_ID}/faxes/inbox/{FAX_ID}
    > DELETE /v2/accounts/{ACCOUNT_ID}/local_provisioner_templates/{TEMPLATE_ID}
    > DELETE /v2/system_configs/{SYSTEM_CONFIG_ID}
    > DELETE /v2/token_auth
    > DELETE /v2/accounts/{ACCOUNT_ID}/rate_limits
    > PUT /v2/accounts/{ACCOUNT_ID}/braintree/transactions
    > GET /v2/accounts/{ACCOUNT_ID}/agents/stats
    > POST /v2/accounts/{ACCOUNT_ID}/storage/plans/{STORAGE_PLAN_ID}
    > POST /v2/accounts/{ACCOUNT_ID}/connectivity/{CONNECTIVITY_ID}
    > GET /v2/accounts/{ACCOUNT_ID}/faxboxes
    > GET /v2/accounts/{ACCOUNT_ID}/global_provisioner_templates/{TEMPLATE_ID}
    > DELETE /v2/accounts/{ACCOUNT_ID}/blacklists/{BLACKLIST_ID}
    > GET /v2/accounts/{ACCOUNT_ID}/menus
    > GET /v2/accounts/{ACCOUNT_ID}/whitelabel/logo
    > GET /v2/accounts/{ACCOUNT_ID}/cccps
    > GET /v2/accounts/{ACCOUNT_ID}/agents/status
    > POST /v2/accounts/{ACCOUNT_ID}/bulk
    > POST /v2/accounts/{ACCOUNT_ID}/service_plans/synchronization
    > GET /v2/accounts/{ACCOUNT_ID}/temporal_rules_sets/{TEMPORAL_RULE_SET}
    > GET /v2/accounts/{ACCOUNT_ID}/whitelabel/icon
    > DELETE /v2/accounts/{ACCOUNT_ID}/menus/{MENU_ID}
    > PUT /v2/ubiquiti_auth
    > PUT /v2/accounts/{ACCOUNT_ID}/braintree/cards
    > DELETE /v2/accounts/{ACCOUNT_ID}/queues/{QUEUE_ID}
    > PUT /v2/accounts/{ACCOUNT_ID}/local_provisioner_templates
    > GET /v2/accounts/{ACCOUNT_ID}/whitelabel/{WHITELABEL_DOMAIN}/welcome
    > GET /v2/accounts/{ACCOUNT_ID}/global_provisioner_templates/{TEMPLATE_ID}/image
    > POST /v2/accounts/{ACCOUNT_ID}/killio/call
    > POST /v2/accounts/{ACCOUNT_ID}/resource_selectors/resource/{RESOURCE_ID}/name/{SELECTOR_NAME}
    > GET /v2/accounts/{ACCOUNT_ID}/hotdesks
    > GET /v2/accounts/{ACCOUNT_ID}/temporal_rules
    > GET /v2/accounts/{ACCOUNT_ID}/apps_link/authorize
    > PATCH /v2/accounts/{ACCOUNT_ID}/blacklists/{BLACKLIST_ID}
    > GET /v2/sup/{MODULE}/{FUNCTION}/{ARGS}
    > GET /v2/accounts/{ACCOUNT_ID}/braintree/transactions
    > GET /v2/accounts/{ACCOUNT_ID}/temporal_rules/{TEMPORAL_RULE_ID}
    > POST /v2/accounts/{ACCOUNT_ID}/configs/{CONFIG_ID}
    > GET /v2/accounts/{ACCOUNT_ID}/global_provisioner_templates
    > PUT /v2/accounts/{ACCOUNT_ID}/alerts
    > PUT /v2/accounts/{ACCOUNT_ID}/sms
    > GET /v2/about
    > POST /v2/accounts/{ACCOUNT_ID}/braintree/cards/{CARD_ID}
    > DELETE /v2/accounts/{ACCOUNT_ID}/metaflows
    > POST /v2/accounts/{ACCOUNT_ID}/global_provisioner_templates/{TEMPLATE_ID}
    > GET /v2/system_configs/{SYSTEM_CONFIG_ID}
    > POST /v2/accounts/{ACCOUNT_ID}/local_provisioner_templates/{TEMPLATE_ID}/image
    > PATCH /v2/accounts/{ACCOUNT_ID}/menus/{MENU_ID}
    > PATCH /v2/accounts/{ACCOUNT_ID}/faxboxes/{FAXBOX_ID}
    > GET /v2/accounts/{ACCOUNT_ID}/contact_list
    > GET /v2/accounts/{ACCOUNT_ID}/bulk
    > GET /v2/accounts/{ACCOUNT_ID}/sms
    > POST /v2/accounts/{ACCOUNT_ID}/rate_limits
    > DELETE /v2/accounts/{ACCOUNT_ID}/local_provisioner_templates/{TEMPLATE_ID}/image
    > GET /v2/accounts/{ACCOUNT_ID}/resource_templates/{RESOURCE_TEMPLATE_ID}
    > GET /v2/accounts/{ACCOUNT_ID}/whitelabel/{WHITELABEL_DOMAIN}/logo
    > GET /v2/token_auth
    > POST /v2/system_configs/{SYSTEM_CONFIG_ID}/{NODE}
    > PUT /v2/ip_auth
    > POST /v2/accounts/{ACCOUNT_ID}/agents/{USER_ID}/status
    > POST /v2/accounts/{ACCOUNT_ID}/whitelabel
    > GET /v2/accounts/{ACCOUNT_ID}/queues/{QUEUE_ID}/roster
    > GET /v2/accounts/{ACCOUNT_ID}/dialplans
    > DELETE /v2/accounts/{ACCOUNT_ID}/templates/{TEMPLATE_NAME}
    > DELETE /v2/accounts/{ACCOUNT_ID}/connectivity/{CONNECTIVITY_ID}
    > GET /v2/accounts/{ACCOUNT_ID}/agents
    > POST /v2/accounts/{ACCOUNT_ID}/storage
    > PUT /v2/accounts/{ACCOUNT_ID}/killio/call
    > GET /v2/accounts/{ACCOUNT_ID}/alerts/{ALERT_ID}
    > GET /v2/accounts/{ACCOUNT_ID}/connectivity
    > GET /v2/accounts/{ACCOUNT_ID}/whitelabel/{WHITELABEL_DOMAIN}
    > PATCH /v2/accounts/{ACCOUNT_ID}/resource_templates/{RESOURCE_TEMPLATE_ID}
    > PUT /v2/accounts/{ACCOUNT_ID}/signup
    > GET /v2/accounts/{ACCOUNT_ID}/presence/report-{REPORT_ID}
    > DELETE /v2/accounts/{ACCOUNT_ID}/temporal_rules/{TEMPORAL_RULE_ID}
    > POST /v2/accounts/{ACCOUNT_ID}/faxboxes/{FAXBOX_ID}
    > PUT /v2/accounts/{ACCOUNT_ID}/faxboxes
    > POST /v2/accounts/{ACCOUNT_ID}/braintree/addresses/{ADDRESS_ID}
    > PUT /v2/shared_auth
    > DELETE /v2/accounts/{ACCOUNT_ID}/braintree/cards/{CARD_ID}
    > POST /v2/accounts/{ACCOUNT_ID}/service_plans/reconciliation
    > GET /v2/sup/{MODULE}
    > PUT /v2/system_configs
    > DELETE /v2/accounts/{ACCOUNT_ID}/temporal_rules_sets/{TEMPORAL_RULE_SET}
    > PUT /v2/accounts/{ACCOUNT_ID}/connectivity
    > PUT /v2/api_auth
    > PATCH /v2/accounts/{ACCOUNT_ID}/temporal_rules/{TEMPORAL_RULE_ID}
    > GET /v2/accounts/{ACCOUNT_ID}/braintree/addresses/{ADDRESS_ID}
    > GET /v2/accounts/{ACCOUNT_ID}/connectivity/{CONNECTIVITY_ID}
    > POST /v2/accounts/{ACCOUNT_ID}/metaflows
    > DELETE /v2/accounts/{ACCOUNT_ID}/global_provisioner_templates/{TEMPLATE_ID}/image
    > GET /v2/accounts/{ACCOUNT_ID}/braintree/cards/{CARD_ID}
    > POST /v2/accounts/{ACCOUNT_ID}/agents/status/{USER_ID}
    > GET /v2/accounts/{ACCOUNT_ID}/agents/status/{USER_ID}
    > PUT /v2/accounts/{ACCOUNT_ID}/menus

    318 / 517 ( 61% documented )

    Documented but not matching any actual API endpoint:
    > GET /v2/channels
    > GET /v2/notifications
    > GET /v2/search/multi
    > POST /v2/resource_selectors
    > GET /v2/accounts/{ACCOUNT_ID}/users/{USER_ID}/cdrs
    > GET /v1/accounts
    > GET /v2/webhooks
    > GET /v2/accounts/{ACCOUNT_ID}/users/{USER_ID}/devices
    > GET /v2/phone_numbers
    > GET /v2/accounts/{ACCOUNT_ID}/users/{USER_ID}/channels
    > GET /v2/tasks
    > GET /v2/accounts/{ACCOUNT_ID}/users/{USER_ID}/recordings
    > PATCH /v2/accounts/{ACCOUNT_ID}/descendants/webhooks
    > GET /v2/accounts/{ACCOUNT_ID}/descendants/port_requests
    > GET /v2/resource_selectors
    > GET /v2/websockets
    > POST /v2/whitelabel/domains
    > GET /v2/search
    > GET /v2/accounts/{ACCOUNT_ID}/about
    > GET /v2/accounts/{ACCOUNT_ID}/devices/{DEVICE_ID}/channels
