scripts/.org/README.org
** update-the-types.sh
Used to search the code looking for deprecated Erlang functions and types and replace them with the newer versions as appropriate
** validate-js.sh
Processes JSON files:
- Checks that _id matches the file name in schema files
- Checks map functions in CouchDB views for 'Object.keys' usage
** validate-swagger.sh
Validate Swagger file using online validator
#+BEGIN_EXAMPLE shell
./scripts/validate-swagger.sh
  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100  2973  100  2973    0     0   4945      0 --:--:-- --:--:-- --:--:--  4938
Swagger file validation errors: 2
{
    "messages": [
        "malformed or unreadable swagger supplied"
    ],
    "schemaValidationMessages": [
        {
            "domain": "validation",
            "instance": {
                "pointer": "/definitions/allotments"
            },
            "keyword": "additionalProperties",
            "level": "error",
            "message": "object instance has properties which are not allowed by the schema: [\"patternProperties\"]",
            "schema": {
                "loadingURI": "http://swagger.io/v2/schema.json#",
                "pointer": "/definitions/schema"
            }
        },
        {
            "domain": "validation",
            "instance": {
                "pointer": "/definitions/domain_hosts"
            },
            "keyword": "additionalProperties",
            "level": "error",
            "message": "object instance has properties which are not allowed by the schema: [\"patternProperties\"]",
            "schema": {
                "loadingURI": "http://swagger.io/v2/schema.json#",
                "pointer": "/definitions/schema"
            }
        },
        {
            "domain": "validation",
            "instance": {
                "pointer": "/definitions/metaflow"
            },
            "keyword": "additionalProperties",
            "level": "error",
            "message": "object instance has properties which are not allowed by the schema: [\"oneOf\"]",
            "schema": {
                "loadingURI": "http://swagger.io/v2/schema.json#",
                "pointer": "/definitions/schema"
            }
        },
        {
            "domain": "validation",
            "instance": {
                "pointer": "/definitions/metaflow_children"
            },
            "keyword": "additionalProperties",
            "level": "error",
            "message": "object instance has properties which are not allowed by the schema: [\"patternProperties\"]",
            "schema": {
                "loadingURI": "http://swagger.io/v2/schema.json#",
                "pointer": "/definitions/schema"
            }
        },
        {
            "domain": "validation",
            "instance": {
                "pointer": "/definitions/storage"
            },
            "keyword": "additionalProperties",
            "level": "error",
            "message": "object instance has properties which are not allowed by the schema: [\"patternProperties\"]",
            "schema": {
                "loadingURI": "http://swagger.io/v2/schema.json#",
                "pointer": "/definitions/schema"
            }
        },
        {
            "domain": "validation",
            "instance": {
                "pointer": "/definitions/storage.attachments"
            },
            "keyword": "additionalProperties",
            "level": "error",
            "message": "object instance has properties which are not allowed by the schema: [\"patternProperties\"]",
            "schema": {
                "loadingURI": "http://swagger.io/v2/schema.json#",
                "pointer": "/definitions/schema"
            }
        },
        {
            "domain": "validation",
            "instance": {
                "pointer": "/definitions/storage.connection.couchdb"
            },
            "keyword": "additionalProperties",
            "level": "error",
            "message": "object instance has properties which are not allowed by the schema: [\"definitions\"]",
            "schema": {
                "loadingURI": "http://swagger.io/v2/schema.json#",
                "pointer": "/definitions/schema"
            }
        },
        {
            "domain": "validation",
            "instance": {
                "pointer": "/definitions/storage.connections"
            },
            "keyword": "additionalProperties",
            "level": "error",
            "message": "object instance has properties which are not allowed by the schema: [\"patternProperties\"]",
            "schema": {
                "loadingURI": "http://swagger.io/v2/schema.json#",
                "pointer": "/definitions/schema"
            }
        },
        {
            "domain": "validation",
            "instance": {
                "pointer": "/definitions/storage.plan.database"
            },
            "keyword": "additionalProperties",
            "level": "error",
            "message": "object instance has properties which are not allowed by the schema: [\"definitions\"]",
            "schema": {
                "loadingURI": "http://swagger.io/v2/schema.json#",
                "pointer": "/definitions/schema"
            }
        }
    ]
}
FIX THESE ISSUES
#+END_EXAMPLE
** wh_to_kz.sh
Part of the great rename, converts Whistle-related names to Kazoo-specific names
